Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2064DAG169.PIC
    <edc:Pin>
      <!--Pin 105-->
      <edc:VirtualPin edc:name="RD12"/>
      <edc:VirtualPin edc:name="PMA12"/>
      <edc:VirtualPin edc:name="RPD12" edc:ppsgroup="3" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="EBIA12"/>
      <edc:VirtualPin edc:name="GD7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 106-->
      <edc:VirtualPin edc:name="RD13"/>
      <edc:VirtualPin edc:name="PMA13"/>
      <edc:VirtualPin edc:name="EBIA13"/>
      <edc:VirtualPin edc:name="GD22"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 107-->
      <edc:VirtualPin edc:name="RF8"/>
      <edc:VirtualPin edc:name="SCL3"/>
      <edc:VirtualPin edc:name="RPF8" edc:ppsgroup="3" edc:ppsval="11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 108-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 109-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 110-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 111-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 112-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 113-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 114-->
      <edc:VirtualPin edc:name="RK5"/>
      <edc:VirtualPin edc:name="EBIA19"/>
      <edc:VirtualPin edc:name="GD14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 115-->
      <edc:VirtualPin edc:name="RK1"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="AN38"/>
      <edc:VirtualPin edc:name="EBIA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 116-->
      <edc:VirtualPin edc:name="RH7"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="AN36"/>
      <edc:VirtualPin edc:name="EBIA4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 117-->
      <edc:VirtualPin edc:name="RH3"/>
      <edc:VirtualPin edc:name="AN35"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 118-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 119-->
      <edc:VirtualPin edc:name="RF5"/>
      <edc:VirtualPin edc:name="PMD8"/>
      <edc:VirtualPin edc:name="SCL5"/>
      <edc:VirtualPin edc:name="RPF5" edc:ppsgroup="2" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="EBID8"/>
      <edc:VirtualPin edc:name="GD16"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 120-->
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="RPF1" edc:ppsgroup="1" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="EBIA10"/>
      <edc:VirtualPin edc:name="GD5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 121-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 122-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 123-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 124-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 125-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 126-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 127-->
      <edc:VirtualPin edc:name="RJ1"/>
      <edc:VirtualPin edc:name="EMDIO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 128-->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="RPD6" edc:ppsgroup="1" edc:ppsval="14"/>
      <edc:VirtualPin edc:name="ETXEN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 129-->
      <edc:VirtualPin edc:name="RK0"/>
      <edc:VirtualPin edc:name="EBIA16"/>
      <edc:VirtualPin edc:name="GD23"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 130-->
      <edc:VirtualPin edc:name="RH11"/>
      <edc:VirtualPin edc:name="AN37"/>
      <edc:VirtualPin edc:name="EBIRDY2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 131-->
      <edc:VirtualPin edc:name="RF0"/>
      <edc:VirtualPin edc:name="PMA11"/>
      <edc:VirtualPin edc:name="RPF0" edc:ppsgroup="2" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="EBIA11"/>
      <edc:VirtualPin edc:name="GD6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 132-->
      <edc:VirtualPin edc:name="RH15"/>
      <edc:VirtualPin edc:name="EBIA23"/>
      <edc:VirtualPin edc:name="GD21"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 133-->
      <edc:VirtualPin edc:name="RF4"/>
      <edc:VirtualPin edc:name="PMD9"/>
      <edc:VirtualPin edc:name="SDA5"/>
      <edc:VirtualPin edc:name="RPF4" edc:ppsgroup="1" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="EBID9"/>
      <edc:VirtualPin edc:name="GD17"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 134-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 135-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 136-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 137-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 138-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 139-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 140-->
      <edc:VirtualPin edc:name="RJ0"/>
      <edc:VirtualPin edc:name="ETXERR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 141-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="PMD14"/>
      <edc:VirtualPin edc:name="EBID14"/>
      <edc:VirtualPin edc:name="GD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 142-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="SCL2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 143-->
      <edc:VirtualPin edc:name="RK3"/>
      <edc:VirtualPin edc:name="EBIA17"/>
      <edc:VirtualPin edc:name="GD12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 144-->
      <edc:VirtualPin edc:name="RF3"/>
      <edc:VirtualPin edc:name="RPF3" edc:ppsgroup="4" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="ERXERR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 145-->
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="RPG1" edc:ppsgroup="1" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="EBIA9"/>
      <edc:VirtualPin edc:name="GD4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 146-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="RPE3" edc:ppsgroup="3" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="EBID3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 147-->
      <edc:VirtualPin edc:name="RH5"/>
      <edc:VirtualPin edc:name="ERXD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 148-->
      <edc:VirtualPin edc:name="RH13"/>
      <edc:VirtualPin edc:name="ERXDV"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 149-->
      <edc:VirtualPin edc:name="RH10"/>
      <edc:VirtualPin edc:name="ECOL"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 150-->
      <edc:VirtualPin edc:name="RH1"/>
      <edc:VirtualPin edc:name="ETXD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 151-->
      <edc:VirtualPin edc:name="RH0"/>
      <edc:VirtualPin edc:name="ETXD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 152-->
      <edc:VirtualPin edc:name="RJ9"/>
      <edc:VirtualPin edc:name="ETXD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 153-->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="RPD7" edc:ppsgroup="2" edc:ppsval="14"/>
      <edc:VirtualPin edc:name="ETXCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 154-->
      <edc:VirtualPin edc:name="RA14"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RPA14" edc:ppsgroup="1" edc:ppsval="13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 155-->
      <edc:VirtualPin edc:name="RK7"/>
      <edc:VirtualPin edc:name="EBIA21"/>
      <edc:VirtualPin edc:name="GD19"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 156-->
      <edc:VirtualPin edc:name="RK6"/>
      <edc:VirtualPin edc:name="EBIA20"/>
      <edc:VirtualPin edc:name="GD15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 157-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 158-->
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="RPG0" edc:ppsgroup="2" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="EBIA8"/>
      <edc:VirtualPin edc:name="GD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 159-->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="EBID2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 160-->
      <edc:VirtualPin edc:name="RH6"/>
      <edc:VirtualPin edc:name="ERXD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 161-->
      <edc:VirtualPin edc:name="RH12"/>
      <edc:VirtualPin edc:name="ECRS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 162-->
      <edc:VirtualPin edc:name="RH9"/>
      <edc:VirtualPin edc:name="ERXD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 163-->
      <edc:VirtualPin edc:name="RH8"/>
      <edc:VirtualPin edc:name="ERXD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 164-->
      <edc:VirtualPin edc:name="RJ11"/>
      <edc:VirtualPin edc:name="EREFCLK"/>
      <edc:VirtualPin edc:name="ERXCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 165-->
      <edc:VirtualPin edc:name="RJ8"/>
      <edc:VirtualPin edc:name="ETXD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 166-->
      <edc:VirtualPin edc:name="RD11"/>
      <edc:VirtualPin edc:name="RPD11" edc:ppsgroup="2" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="EMDC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 167-->
      <edc:VirtualPin edc:name="RA15"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RPA15" edc:ppsgroup="2" edc:ppsval="13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 168-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="EBIRDY1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 169-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T2CK" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T6CK" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC7" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2CTS" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U5RX" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U6CTS" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI1" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI3" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI5" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS6" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI1" edc:ppsgroup="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T5CK" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T7CK" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC8" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3RX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4CTS" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI2" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="C1RX" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI4" edc:ppsgroup="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T3CK" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T8CK" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC2" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC5" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC9" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1CTS" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2RX" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U5CTS" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS3" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS4" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS5" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="C2RX" edc:ppsgroup="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T4CK" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T9CK" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC1" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC6" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3CTS" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4RX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U6RX" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI6" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFA" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="REFCLKI3" edc:ppsgroup="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3TX" edc:ppsgroup="1" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4RTS" edc:ppsgroup="1" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="1" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="1" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO3" edc:ppsgroup="1" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO5" edc:ppsgroup="1" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS6" edc:ppsgroup="1" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC3" edc:ppsgroup="1" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC6" edc:ppsgroup="1" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO4" edc:ppsgroup="1" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsgroup="1" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1TX" edc:ppsgroup="1" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1TX" edc:ppsgroup="2" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2RTS" edc:ppsgroup="2" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5TX" edc:ppsgroup="2" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U6RTS" edc:ppsgroup="2" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsgroup="2" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsgroup="2" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO3" edc:ppsgroup="2" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO4" edc:ppsgroup="2" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO5" edc:ppsgroup="2" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC4" edc:ppsgroup="2" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC7" edc:ppsgroup="2" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO1" edc:ppsgroup="2" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3RTS" edc:ppsgroup="3" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4TX" edc:ppsgroup="3" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U6TX" edc:ppsgroup="3" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS1" edc:ppsgroup="3" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS3" edc:ppsgroup="3" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS4" edc:ppsgroup="3" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS5" edc:ppsgroup="3" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO6" edc:ppsgroup="3" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC5" edc:ppsgroup="3" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC8" edc:ppsgroup="3" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsgroup="3" edc:ppsval="14"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="REFCLKO3" edc:ppsgroup="3" edc:ppsval="15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1RTS" edc:ppsgroup="4" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2TX" edc:ppsgroup="4" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U5RTS" edc:ppsgroup="4" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U6TX" edc:ppsgroup="4" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS2" edc:ppsgroup="4" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO4" edc:ppsgroup="4" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO6" edc:ppsgroup="4" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC2" edc:ppsgroup="4" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC1" edc:ppsgroup="4" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC9" edc:ppsgroup="4" edc:ppsval="13"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2TX" edc:ppsgroup="4" edc:ppsval="15"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
